/*
 * Copyright (C) 2025 Storia-LITE, an open-source software by TruveSoftware
 * (a division of Vytruve.org)
 * 
 * Original Author: Pedro Henrique / phkaiser13
 * 
 * Description:
 *   This file provides the application's configuration settings for the development
 *   environment. It includes settings for logging, database connection, and JSON
 *   Web Token (JWT) generation.
 * 
 *   **IMPORTANT FOR USERS**: You must replace the placeholder values (like
 *   "YOUR_DATABASE_HOST", "YOUR_PASSWORD_HERE", etc.) with your actual
 *   development environment settings. Do not use these settings in production.
 *   Remove the comments before deploying to production. 
*    Rename this file to "appsettings.json" after configuring it.
 * 
 * More information: https://vytruve.org
 *
 * SPDX-License-Identifier: Apache-2.0
 */



{
  // Configures the logging behavior of the application.
  "Logging": {
    "LogLevel": {
      // "Default" sets the minimum level for all logs unless overridden. "Information" is a good default for development.
      "Default": "Information",
      // Overrides the log level specifically for Microsoft's own components to "Warning", reducing noise in the logs.
      "Microsoft.AspNetCore": "Warning"
    }
  },

  // Specifies which hosts are allowed to make requests to this server. "*" allows all hosts, which is common for development but should be restricted in production.
  "AllowedHosts": "*",

  // Contains the connection strings for databases used by the application.
  "ConnectionStrings": {
    // The primary database connection. You must replace the following values with your own.
    "DefaultConnection": "Host=YOUR_DATABASE_HOST;Port=5432;Database=YOUR_DATABASE_NAME;Username=YOUR_DATABASE_USER;Password=YOUR_PASSWORD_HERE;SslMode=Disable;Trust Server Certificate=true"
  },

  // Configuration for JSON Web Token (JWT) generation and validation.
  "JwtSettings": {
    // **CRITICAL SECURITY**: This is the secret key used to sign the JWTs.
    // It MUST be a long, complex, and unique string. Do NOT use this default value in production.
    // Consider using the 'dotnet user-secrets' tool for managing this in development.
    "Secret": "REPLACE_THIS_WITH_A_VERY_LONG_AND_STRONG_SECRET_KEY_32_CHARS_OR_MORE",

    // The duration in minutes for which a JWT access token will be valid.
    "ExpiryMinutes": 60,

    // The "issuer" claim for the JWT, identifying who issued the token.
    "Issuer": "StorIA-Lite",

    // The "audience" claim for the JWT, identifying the intended recipient of the token.
    "Audience": "StorIA-Lite",

    // The duration in days for which a refresh token will be valid.
    "RefreshTokenExpiryInDays": 7
  }
}
